Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Организации</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнойДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловнойКонтрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньДоступа</Name>
					<Comment>Категория клиента для видимости опт-каталога на сайте (Всем/Постоянный/VIP2/VIP1). Считается регламентным заданием по головному контрагенту, если не установлена вручную.</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньДоступаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньУстановленВручную</Name>
					<Comment>Если истина — регламентное задание не пересчитывает УровеньДоступа у этого контрагента.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Покупатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>(Регл) Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУдостоверяющийЛичность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджерПокупателя</Name>
					<Comment>(Упр) Основной менеджер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительноеОписание</Name>
					<Comment>(Общ) Дополнительное описание</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасписаниеРаботыСтрокой</Name>
					<Comment>(Общ) Расписание работы строкой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыполненияЗаказаПоставщиком</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформацииПриОбращении</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиИнформацииПриОбращенииПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеКонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВидДеятельности</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоЕДРПОУ</Name>
					<Comment>(Регл) Код по ЕДРПОУ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСвидетельства</Name>
					<Comment>Номер свидетельства плательщика НДС</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступаККонтрагенту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаККонтрагентам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеЯвляетсяРезидентом</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнятьНаименованиеАдресДаннымиГоловногоКонтрагентаВНН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВЧерномСписке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗагрузкиНоменклатурыПоставщиков</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БыстрыйФильтр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦеныГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НЕСохранятьИсторию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьРассылку</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРезервирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СхемыРезервирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СМСПоОсновномуТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздатьНовогоКонтрагентаИзПолучателя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентНаТТН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойКонтакт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IDСайта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоВизитаНаСайте</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстанавливатьФлагРезервПоКонтрагентуВЗаказе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрыватьВсеАктивныеЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВРНПодробноеОписание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СоздаватьНовуюЗадачуПоЗаказу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючАпи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьТТННаплатформе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>комиссия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправлятьСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛМ_КлючAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаценкаНаБазовыйТипЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассылкаТГ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДеятельности</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДеятельностиКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МенеджерыПокупателя</Name>
					<Comment>(Упр)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МенеджерПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоваяПочта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Отделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛМ_Города</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Скидки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаСумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТорговыеТочки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Регионы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроизводствоЧерезВозврат/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Производство через возврат: задачи Антону по неправильно оформленному приходу.
//
// Сшитое производителями организации "через Возврат" приходуется документом
// ВозвратТоваровОтПокупателя от контрагента "Цветков Произ" (код 000009930),
// в комментарии - номер кроя: "Кр № 19 Алиса рубашка 146 - 158р кол - во 72 шт".
// Организация берётся из номенклатуры. Проверок две (пользователь, 15.09.2026):
//
// 1. Цена 1 грн в таком возврате. Цена возврата - цена пошива: в 2025 году
//    380-1315 грн, с 2026 года её стали ставить 1 грн, и деньги за пошив из
//    базы пропадали. Модели организации "Полная оплата" не отслеживаются:
//    пошив у неё оплачен целиком, и 1 грн - её обычная цена и в отчётах
//    производства за смену, и в возвратах (выше 1 грн у неё нет ни строки).
//
// 2. Отчёт производства за смену по модели "через Возврат". У этой организации
//    приход - только возврат, отчёт надо перенести в документ возврата
//    (к 15.09.2026 пять отчётов: Холли №954, 961, Рэйчел №1041-1043).
//
// На каждый документ - одна задача. Документ исправили (цену проставили, отчёт
// распровели или пометили на удаление) - задача закрывается сама. Если по
// документу задача уже была, в том числе закрытая вручную, новая не заводится.
//
// Запускается регламентом ТелеграмОбмен (ТелеграмБот.ОбменСБотом) рядом с
// задачами на замеры и по той же причине: это единственное задание с
// расписанием раз в 1-2 минуты, а расписание нового задания пришлось бы
// заводить в базе руками.
////////////////////////////////////////////////////////////////////////////////

// Точка входа регламента: по каждой проверке закрывает отработанные задачи
// и заводит новые.
Процедура ЗадачиПоПроизводству() Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Исполнитель = Справочники.Пользователи.НайтиПоНаименованию(ИмяИсполнителя(), Истина);

	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		ЗаписьЖурналаРегистрации("Производство.Задачи", УровеньЖурналаРегистрации.Ошибка, , ,
			"Пользователь """ + ИмяИсполнителя()
			+ """ не найден - новые задачи по производству создавать не на кого.");
	КонецЕсли;

	Контрагент = Справочники.Контрагенты.НайтиПоКоду(КодКонтрагентаПроизводства());

	Если ЗначениеЗаполнено(Контрагент) Тогда
		ОбработатьЗадачи(ВидЦенаОдинГривна(), ДокументыПоЦенеОдинГривна(Контрагент), Исполнитель);
	Иначе
		ЗаписьЖурналаРегистрации("Производство.Задачи", УровеньЖурналаРегистрации.Ошибка, , ,
			"Контрагент с кодом " + КодКонтрагентаПроизводства()
			+ " (Цветков Произ) не найден - цена 1 грн в возвратах не отслеживается.");
	КонецЕсли;

	ОбработатьЗадачи(ВидОтчетВместоВозврата(), ОтчетыПоМоделямЧерезВозврат(), Исполнитель);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройки.

// Контрагент, от которого возвратом приходуется производство.
Функция КодКонтрагентаПроизводства()
	Возврат "000009930"; // Цветков Произ
КонецФункции

// Кому уходят задачи. Как и у задач на замеры, пользователь ищется по
// наименованию: у элементов справочника Пользователи код равен наименованию.
Функция ИмяИсполнителя()
	Возврат "Антон";
КонецФункции

// Строки дешевле этой цены (включительно) считаются незаполненной ценой пошива.
// Включительно - чтобы нулевая цена тоже попадала.
Функция ПороговаяЦена()
	Возврат 1;
КонецФункции

// Префикс - начало ИдентификатораСобытия задачи. Дефис, а не подчёркивание:
// по маске с префиксом идёт поиск через ПОДОБНО, а "_" там значит "любой символ".
Функция ВидЦенаОдинГривна()
	Возврат Новый Структура("Имя, Префикс, Название",
		"Цена", "ЦенаПроизводства-", "по цене " + ПороговаяЦена() + " грн");
КонецФункции

Функция ВидОтчетВместоВозврата()
	Возврат Новый Структура("Имя, Префикс, Название",
		"Отчет", "ОтчетЧерезВозврат-", "на перенос отчёта производства в возврат");
КонецФункции

// Организации номенклатуры по кодам: наименования здесь - рабочие метки.
Функция ОрганизацииПоКодам(Знач Коды)

	Организации = Новый Массив;

	Для Каждого Код Из Коды Цикл
		Организация = Справочники.Организации.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(Организация) Тогда
			Организации.Добавить(Организация);
		КонецЕсли;
	КонецЦикла;

	Возврат Организации;

КонецФункции

// Организации, у которых 1 грн в возврате - нормальная цена.
Функция ИсключенныеИзЦены()

	Коды = Новый Массив;
	Коды.Добавить("000000002"); // Полная оплата

	Возврат ОрганизацииПоКодам(Коды);

КонецФункции

// Организации, у которых приход - только возвратом.
Функция ПриходТолькоВозвратом()

	Коды = Новый Массив;
	Коды.Добавить("000000004"); // через Возврат

	Возврат ОрганизацииПоКодам(Коды);

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Документы, по которым нужны задачи.
// Соответствие: документ -> массив структур (Номенклатура, Организация, Количество).

// Проведённые возвраты от контрагента производства со строками по 1 грн,
// без моделей исключённых организаций.
Функция ДокументыПоЦенеОдинГривна(Знач Контрагент)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент",  Контрагент);
	Запрос.УстановитьПараметр("Цена",        ПороговаяЦена());
	Запрос.УстановитьПараметр("Исключенные", ИсключенныеИзЦены());
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Ссылка КАК Документ,
	               |	Товары.Номенклатура КАК Номенклатура,
	               |	Товары.Номенклатура.Организация КАК Организация,
	               |	СУММА(Товары.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ВозвратТоваровОтПокупателя.Товары КАК Товары
	               |ГДЕ
	               |	Товары.Ссылка.Проведен
	               |	И Товары.Ссылка.Контрагент = &Контрагент
	               |	И Товары.Цена <= &Цена
	               |	И НЕ Товары.Номенклатура.Организация В (&Исключенные)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Товары.Ссылка,
	               |	Товары.Номенклатура,
	               |	Товары.Номенклатура.Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Документ,
	               |	Номенклатура";

	Возврат СтрокиПоДокументам(Запрос.Выполнить().Выбрать());

КонецФункции

// Проведённые отчёты производства за смену по моделям, у которых приход -
// только возвратом. Организация не найдена по коду - список пуст, задач нет.
Функция ОтчетыПоМоделямЧерезВозврат()

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организации", ПриходТолькоВозвратом());
	Запрос.Текст = "ВЫБРАТЬ
	               |	Продукция.Ссылка КАК Документ,
	               |	Продукция.Номенклатура КАК Номенклатура,
	               |	Продукция.Номенклатура.Организация КАК Организация,
	               |	СУММА(Продукция.Количество) КАК Количество
	               |ИЗ
	               |	Документ.ОтчетПроизводстваЗаСмену.Продукция КАК Продукция
	               |ГДЕ
	               |	Продукция.Ссылка.Проведен
	               |	И Продукция.Номенклатура.Организация В (&Организации)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Продукция.Ссылка,
	               |	Продукция.Номенклатура,
	               |	Продукция.Номенклатура.Организация
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Документ,
	               |	Номенклатура";

	Возврат СтрокиПоДокументам(Запрос.Выполнить().Выбрать());

КонецФункции

Функция СтрокиПоДокументам(Знач Выборка)

	Результат = Новый Соответствие;

	Пока Выборка.Следующий() Цикл

		Строки = Результат[Выборка.Документ];

		Если Строки = Неопределено Тогда
			Строки = Новый Массив;
			Результат.Вставить(Выборка.Документ, Строки);
		КонецЕсли;

		Строки.Добавить(Новый Структура("Номенклатура, Организация, Количество",
			Выборка.Номенклатура, Выборка.Организация, Выборка.Количество));

	КонецЦикла;

	Возврат Результат;

КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Заведение и закрытие задач.

Процедура ОбработатьЗадачи(Знач Вид, Знач Документы_, Знач Исполнитель)

	ЗакрытьЗадачиПоИсправленнымДокументам(Вид, Документы_);

	Если ЗначениеЗаполнено(Исполнитель) Тогда
		ЗавестиЗадачиПоДокументам(Вид, Документы_, Исполнитель);
	КонецЕсли;

КонецПроцедуры

Функция ИдентификаторЗадачи(Знач Вид, Знач Документ)
	Возврат Вид.Префикс + Строка(Документ.УникальныйИдентификатор());
КонецФункции

Процедура ЗавестиЗадачиПоДокументам(Знач Вид, Знач Документы_, Знач Исполнитель)

	Если Документы_.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	// Любая задача с таким идентификатором - открытая или закрытая - значит,
	// что документ уже в работе или по нему решили оставить как есть.
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Маска", Вид.Префикс + "%");
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	Задачи.ИдентификаторСобытия КАК Идентификатор
	               |ИЗ
	               |	Задача.ЗадачиПользователя КАК Задачи
	               |ГДЕ
	               |	Задачи.ИдентификаторСобытия ПОДОБНО &Маска";

	Заведенные = Новый Соответствие;

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Заведенные.Вставить(СокрЛП(Выборка.Идентификатор), Истина);
	КонецЦикла;

	Для Каждого Элемент Из Документы_ Цикл

		Если Заведенные[ИдентификаторЗадачи(Вид, Элемент.Ключ)] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		СоздатьЗадачу(Вид, Исполнитель, Элемент.Ключ, Элемент.Значение);

	КонецЦикла;

КонецПроцедуры

Процедура СоздатьЗадачу(Знач Вид, Знач Исполнитель, Знач Документ, Знач Строки)

	// 9:00 сегодняшнего дня - как у остальных задач базы
	// (ЗамерыНоменклатуры.СоздатьЗадачуНаЗамеры, ТелеграмБот.ЗадачаДляЗаказа).
	Срок = НачалоДня(ТекущаяДата()) + 32400;

	ДатаДокумента = Формат(Документ.Дата, "ДФ=dd.MM.yyyy");

	Описание = Новый Массив;

	Если Вид.Имя = "Цена" Тогда

		Наименование = "Цена " + ПороговаяЦена() + " грн: возврат "
			+ СокрЛП(Документ.Номер) + " от " + ДатаДокумента;

		Описание.Добавить("Производство оприходовано возвратом от ""Цветков Произ"" по цене "
			+ ПороговаяЦена() + " грн. Проставить в документе цену пошива -"
			+ " задача закроется сама.");

	Иначе

		Наименование = "Перенести в возврат: отчёт производства "
			+ СокрЛП(Документ.Номер) + " от " + ДатаДокумента;

		Описание.Добавить("Модель организации ""через Возврат"" оприходована отчётом"
			+ " производства за смену, а у этой организации приход - только возвратом.");
		Описание.Добавить("Перенести в документ ""Возврат товаров от покупателя"" от"
			+ " ""Цветков Произ"" (в комментарии - номер кроя, цена - цена пошива),"
			+ " отчёт производства распровести или пометить на удаление -"
			+ " задача закроется сама.");

	КонецЕсли;

	Описание.Добавить("Документ: " + СокрЛП(Строка(Документ)));

	Комментарий = СокрЛП(Документ.Комментарий);

	Если НЕ ПустаяСтрока(Комментарий) Тогда
		Описание.Добавить("Комментарий: " + Комментарий);
	КонецЕсли;

	Описание.Добавить(?(Вид.Имя = "Цена", "Строки по " + ПороговаяЦена() + " грн:", "Продукция:"));

	Для Каждого Стр Из Строки Цикл

		Организация = ?(ЗначениеЗаполнено(Стр.Организация),
			СокрЛП(Стр.Организация.Наименование), "не заполнена");

		Описание.Добавить("  " + СокрЛП(Строка(Стр.Номенклатура))
			+ " - " + Формат(Стр.Количество, "ЧГ=0") + " шт., организация: " + Организация);

	КонецЦикла;

	Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();

	Задача.ИдентификаторСобытия = ИдентификаторЗадачи(Вид, Документ);
	Задача.Наименование         = Лев(Наименование, 100);
	Задача.Описание             = СтрСоединить(Описание, Символы.ПС);
	Задача.Исполнитель          = Исполнитель;
	Задача.Объект               = Документ;
	Задача.Дата                 = Срок;
	Задача.СрокИсполнения       = Срок;
	Задача.Оповещение           = Истина;
	Задача.СрокОповещения       = Срок;

	Попытка

		Задача.Записать();

		ЗаписьЖурналаРегистрации("Производство.Задачи",
			УровеньЖурналаРегистрации.Информация,
			Документ.Метаданные(), Документ,
			"Заведена задача " + Вид.Название + ".");

	Исключение

		ЗаписьЖурналаРегистрации("Производство.Задачи",
			УровеньЖурналаРегистрации.Ошибка,
			Документ.Метаданные(), Документ,
			"Задача " + Вид.Название + " не создана: " + ОписаниеОшибки());

	КонецПопытки;

КонецПроцедуры

// Документа больше нет среди нуждающихся в задаче - цену исправили, документ
// распровели или удалили, либо модель теперь другой организации.
// Закрываем сами, иначе список копит сделанную или ненужную работу.
Процедура ЗакрытьЗадачиПоИсправленнымДокументам(Знач Вид, Знач Документы_)

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Маска", Вид.Префикс + "%");
	Запрос.Текст = "ВЫБРАТЬ
	               |	Задачи.Ссылка КАК Ссылка,
	               |	Задачи.Объект КАК Объект
	               |ИЗ
	               |	Задача.ЗадачиПользователя КАК Задачи
	               |ГДЕ
	               |	НЕ Задачи.Выполнена
	               |	И Задачи.ИдентификаторСобытия ПОДОБНО &Маска";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		Если Документы_[Выборка.Объект] <> Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Попытка

			Объект = Выборка.Ссылка.ПолучитьОбъект();
			Объект.Выполнена = Истина;

			Если НЕ ЗначениеЗаполнено(Объект.ДатаИсполнения) Тогда
				Объект.ДатаИсполнения = ТекущаяДата();
			КонецЕсли;

			Объект.Записать();

			ЗаписьЖурналаРегистрации("Производство.Задачи",
				УровеньЖурналаРегистрации.Информация, , Выборка.Объект,
				"Задача " + Вид.Название + " закрыта: документ исправлен.");

		Исключение

			ЗаписьЖурналаРегистрации("Производство.Задачи",
				УровеньЖурналаРегистрации.Ошибка, , Выборка.Объект,
				"Задача " + Вид.Название + " не закрыта: " + ОписаниеОшибки());

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры
